mentalibor/STM32f446RE_drivers/Src/stm32f44xx_i2c.c
/******************************************************************************
** Copyright (c) 2021 Mentalibor. All rights reserved. Email: mentalibor@gmail.com
**
** Name
** stm32f44xx_i2c.c
**
** Purpose
** I2C driver for the STM32F44XX
**
** Revision
** 08-Feb-2021 (Mentalibor) Initial version.
**
******************************************************************************/

#include "stm32f44xx_i2c.h"

/** *****************************************************************************
 * @ingroup static_i2c
 * @brief Generates start condition of the I2C communication
 *
 * @param[in]   pI2Cx  Reference to the I2C definition structure
 *
 ******************************************************************************/
static void I2C_GenerateStartCondition ( I2C_RegDef_t *pI2Cx);

/** *****************************************************************************
 * @ingroup static_i2c
 * @brief Executes the address phase with write operation bit
 *
 * @param[in]   pGPIOx  	Reference to the I2C definition structure
 * @param[in]	SlaveAddr	Address of the slave device
 *
 ******************************************************************************/
static void I2C_ExecuteAddressPhaseWrite 	( I2C_RegDef_t *pI2Cx
											, uint8_t SlaveAddr
											);

/** *****************************************************************************
 * @ingroup static_i2c
 * @brief Executes the address phase with read operation bit
 *
 * @param[in]   pGPIOx  	Reference to the I2C definition structure
 * @param[in]	SlaveAddr	Address of the slave device
 *
 ******************************************************************************/
static void I2C_ExecuteAddressPhaseRead ( I2C_RegDef_t *pI2Cx
										, uint8_t SlaveAddr
										);

/** *****************************************************************************
 * @ingroup static_i2c
 * @brief Clears the ADDR flag by reading SR1 and SR2 registers
 *
 * @param[in]   pI2CHandle  Reference to the I2C handler
 *
 ******************************************************************************/
static void I2C_ClearADDRFlag( I2C_Handle_t *pI2CHandle);

/** *****************************************************************************
 * @ingroup static_i2c
 * @brief Handles the interrupt in case of RXNE event
 *
 * @param[in]   pI2CHandle  Reference to the I2C handler
 *
 ******************************************************************************/
static void I2C_MasterHandleRXNEInterrupt( I2C_Handle_t *pI2CHandle );

/** *****************************************************************************
 * @ingroup static_i2c
 * @brief Handles the interrupt in case of TXE event
 *
 * @param[in]   pI2CHandle  Reference to the I2C handler
 *
 ******************************************************************************/
static void I2C_MasterHandleTXEInterrupt( I2C_Handle_t *pI2CHandle );

/*******************************************************************************
 * @ingroup api_i2c
 * @brief Generates stop condition of the I2C communication
 *
 * @param[in]   pI2Cx  Reference to the I2C definition structure
 *
 ******************************************************************************/
void I2C_GenerateStopCondition( I2C_RegDef_t *pI2Cx)
{
	pI2Cx->CR1 |= ( 1 << I2C_CR1_STOP);
}

 /** *****************************************************************************
  * @ingroup api_i2c
  * @brief Enables or disables the callback events
  *
  * @param[in]   pI2Cx   Reference to the I2C definition structure
  * @param[in]   EnorDi  ENABLE/DISABLE macro
  *
  ******************************************************************************/
void I2C_SlaveEnableDisableCallbackEvents	( I2C_RegDef_t *pI2Cx
		 	 	 	 	 	 	 	 	 	, uint8_t EnorDi
											)
 {
	 if(EnorDi == ENABLE)
	 {
			pI2Cx->CR2 |= ( 1 << I2C_CR2_ITEVTEN);
			pI2Cx->CR2 |= ( 1 << I2C_CR2_ITBUFEN);
			pI2Cx->CR2 |= ( 1 << I2C_CR2_ITERREN);
	 }
	 else
	 {
			pI2Cx->CR2 &= ~( 1 << I2C_CR2_ITEVTEN);
			pI2Cx->CR2 &= ~( 1 << I2C_CR2_ITBUFEN);
			pI2Cx->CR2 &= ~( 1 << I2C_CR2_ITERREN);
	 }
 }

 /*******************************************************************************
  * @ingroup api_i2c
  * @brief Enables or disables the I2C peripheral
  *
  * @param[in]   pI2Cx   Reference to the I2C definition structure
  * @param[in]   EnorDi  ENABLE/DISABLE macro
  *
  ******************************************************************************/
void I2C_PeripheralControl	( I2C_RegDef_t *pI2Cx
							, uint8_t EnOrDi
							)
{
	if(EnOrDi == ENABLE)
	{
		pI2Cx->CR1 |= (1 << I2C_CR1_PE);
	}
	else
	{
		pI2Cx->CR1 &= ~(1 << 0);
	}
}

/*******************************************************************************
 * @ingroup api_i2c
 * @brief Enables or disables the I2C peripheral clock
 *
 * @param[in]   pI2Cx   Reference to the I2C definition structure
 * @param[in]   EnorDi  ENABLE/DISABLE macro
 *
 ******************************************************************************/
void I2C_PeriClockControl	( I2C_RegDef_t *pI2Cx
							, uint8_t EnorDi
							)
{
	if(EnorDi == ENABLE)
	{
		if(pI2Cx == I2C1)
		{
			I2C1_PCLK_EN();
		}
		else if (pI2Cx == I2C2)
		{
			I2C2_PCLK_EN();
		}
		else if (pI2Cx == I2C3)
		{
			I2C3_PCLK_EN();
		}
	}
	else
	{
		if(pI2Cx == I2C1)
		{
			I2C1_PCLK_DI();
		}
		else if (pI2Cx == I2C2)
		{
			I2C2_PCLK_DI();
		}
		else if (pI2Cx == I2C3)
		{
			I2C3_PCLK_DI();
		}
	}

}

/*******************************************************************************
 * @ingroup api_i2c
 * @brief Initializes the I2C peripheral
 *
 * @param[in]   pI2CHandle  Reference to the I2C handler
 *
 ******************************************************************************/
void I2C_Init( I2C_Handle_t *pI2CHandle)
{
	uint32_t tempreg = 0 ;

	//enable the clock for the i2cx peripheral
	I2C_PeriClockControl(pI2CHandle->pI2Cx,ENABLE);

	//ack control bit
	tempreg |= pI2CHandle->I2C_Config.I2C_AckControl << 10;
	pI2CHandle->pI2Cx->CR1 = tempreg;

	//configure the FREQ field of CR2
	tempreg = 0;
	tempreg |= RCC_GetPCLK1Value() /1000000U ;
	pI2CHandle->pI2Cx->CR2 =  (tempreg & 0x3F);

    //program the device own address
	tempreg = 0;
	tempreg |= pI2CHandle->I2C_Config.I2C_DeviceAddress << 1;
	tempreg |= ( 1 << 14);
	pI2CHandle->pI2Cx->OAR1 = tempreg;

	//CCR calculations
	uint16_t ccr_value = 0;
	tempreg = 0;
	if(pI2CHandle->I2C_Config.I2C_SCLSpeed <= I2C_SCL_SPEED_SM)
	{
		//mode is standard mode
		ccr_value = (RCC_GetPCLK1Value() / ( 2 * pI2CHandle->I2C_Config.I2C_SCLSpeed ) );
		tempreg |= (ccr_value & 0xFFF);
	}
	else
	{
		//mode is fast mode
		tempreg |= ( 1 << 15);
		tempreg |= (pI2CHandle->I2C_Config.I2C_FMDutyCycle << 14);
		if(pI2CHandle->I2C_Config.I2C_FMDutyCycle == I2C_FM_DUTY_2)
		{
			ccr_value = (RCC_GetPCLK1Value() / ( 3 * pI2CHandle->I2C_Config.I2C_SCLSpeed ) );
		}
		else
		{
			ccr_value = (RCC_GetPCLK1Value() / ( 25 * pI2CHandle->I2C_Config.I2C_SCLSpeed ) );
		}
		tempreg |= (ccr_value & 0xFFF);
	}
	pI2CHandle->pI2Cx->CCR = tempreg;

	//TRISE Configuration
	if(pI2CHandle->I2C_Config.I2C_SCLSpeed <= I2C_SCL_SPEED_SM)
	{
		//mode is standard mode

		tempreg = (RCC_GetPCLK1Value() /1000000U) + 1 ;

