mentalibor/STM32f446RE_drivers/Src/stm32f44xx_i2c.c
	}
	else
	{
		//mode is fast mode
		tempreg = ( (RCC_GetPCLK1Value() * 300) / 1000000000U ) + 1;

	}

	pI2CHandle->pI2Cx->TRISE = (tempreg & 0x3F);
}

/*******************************************************************************
 * @ingroup api_i2c
 * @brief Deinitializes the I2C peripheral
 *
 * @param[in]   pI2Cx   Reference to the I2C definition structure
 *
 ******************************************************************************/
void I2C_DeInit(I2C_RegDef_t *pI2Cx)
{
	if (pI2Cx == I2C1)
	{
		I2C1_REG_RESET();
	}

	else if (pI2Cx == I2C2)
	{
		I2C2_REG_RESET();
	}

	else if (pI2Cx == I2C3)
	{
		I2C3_REG_RESET();
	}

}

/*******************************************************************************
 * @ingroup api_i2c
 * @brief Gets flag status from the SR1 register
 *
 * @param[in]   pI2Cx   	Reference to the I2C definition structure
 * @param[in]   FlagName   	flag name
 *
 * @return uint8_t
 * @retval FLAG_SET
 * @retval FLAG_RESET
 ******************************************************************************/
uint8_t I2C_GetFlagStatus	(I2C_RegDef_t *pI2Cx
							, uint32_t FlagName
							)
{
	if(pI2Cx->SR1 & FlagName)
	{
		return FLAG_SET;
	}
	return FLAG_RESET;
}

/********************************************************************************
 * @ingroup api_i2c
 * @brief Sends data as master in blocking mode
 *
 * @param[in]   pI2CHandle  Reference to the I2C handler
 * @param[in]	pTxbuffer	Reference to the TX buffer
 * @param[in]	Len			Length of the TX buffer
 * @param[in]	SlaveAddr	Slave address
 * @param[in]	Sr			Flag for stop condition bit
 *
 ******************************************************************************/
void I2C_MasterSendData ( I2C_Handle_t *pI2CHandle
						, uint8_t *pTxbuffer
						, uint32_t Len
						, uint8_t SlaveAddr
						, uint8_t Sr
						)
{
	// generate the START condition
	I2C_GenerateStartCondition(pI2CHandle->pI2Cx);

	//confirm that start generation is completed
	while( !  I2C_GetFlagStatus(pI2CHandle->pI2Cx,I2C_FLAG_SB)   );

	//send the address of the slave with r/nw bit set to w(0) (total 8 bits )
	I2C_ExecuteAddressPhaseWrite(pI2CHandle->pI2Cx,SlaveAddr);

	//confirm that address phase is completed
	while( !  I2C_GetFlagStatus(pI2CHandle->pI2Cx,I2C_FLAG_ADDR)   );

	//clear the ADDR flag according to its software sequenc
	I2C_ClearADDRFlag(pI2CHandle);

	//send the data until len becomes 0

	while(Len > 0)
	{
		while(! I2C_GetFlagStatus(pI2CHandle->pI2Cx,I2C_FLAG_TXE) ); //Wait till TXE is set
		pI2CHandle->pI2Cx->DR = *pTxbuffer;
		pTxbuffer++;
		Len--;
	}

	//when Len becomes zero, wait for TXE=1 and BTF=1 before generating the STOP condition

	while(! I2C_GetFlagStatus(pI2CHandle->pI2Cx,I2C_FLAG_TXE) );

	while(! I2C_GetFlagStatus(pI2CHandle->pI2Cx,I2C_FLAG_BTF) );


	//generate STOP condition and master need not to wait for the completion of stop condition.
	if(Sr == I2C_DISABLE_SR )
		I2C_GenerateStopCondition(pI2CHandle->pI2Cx);
}

/*******************************************************************************
 * @ingroup api_i2c
 * @brief Receives data as master in blocking mode
 *
 * @param[in]   pI2CHandle  Reference to the I2C handler
 * @param[in]	pTxbuffer	Reference to the RX buffer
 * @param[in]	Len			Length of the RX buffer
 * @param[in]	SlaveAddr	Slave address
 * @param[in]	Sr			Flag for stop condition bit
 *
 ******************************************************************************/
void I2C_MasterReceiveData	( I2C_Handle_t *pI2CHandle
							, uint8_t *pRxBuffer
							, uint8_t Len
							, uint8_t SlaveAddr
							, uint8_t Sr
							)
{

	//generate the START condition
	I2C_GenerateStartCondition(pI2CHandle->pI2Cx);

	//confirm that start generation is completed
	while( !  I2C_GetFlagStatus(pI2CHandle->pI2Cx,I2C_FLAG_SB)   );

	//send the address of the slave with r/nw bit set to R(1) (total 8 bits )
	I2C_ExecuteAddressPhaseRead(pI2CHandle->pI2Cx,SlaveAddr);

	//wait until address phase is completed
	while( !  I2C_GetFlagStatus(pI2CHandle->pI2Cx,I2C_FLAG_ADDR)   );

	//procedure to read only 1 byte from slave
	if(Len == 1)
	{
		//Disable Acking
		I2C_ManageAcking(pI2CHandle->pI2Cx,I2C_ACK_DISABLE);


		//clear the ADDR flag
		I2C_ClearADDRFlag(pI2CHandle);

		//wait until  RXNE becomes 1
		while(! I2C_GetFlagStatus(pI2CHandle->pI2Cx,I2C_FLAG_RXNE) );

		//generate STOP condition
		if(Sr == I2C_DISABLE_SR )
			I2C_GenerateStopCondition(pI2CHandle->pI2Cx);

		//read data in to buffer
		*pRxBuffer = pI2CHandle->pI2Cx->DR;

	}

    //procedure to read data from slave when Len > 1
	if(Len > 1)
	{
		//clear the ADDR flag
		I2C_ClearADDRFlag(pI2CHandle);

		//read the data until Len becomes zero
		for ( uint32_t i = Len ; i > 0 ; i--)
		{
			//wait until RXNE becomes 1
			while(! I2C_GetFlagStatus(pI2CHandle->pI2Cx,I2C_FLAG_RXNE) );

			if(i == 2) //if last 2 bytes are remaining
			{
				//Disable Acking
				I2C_ManageAcking(pI2CHandle->pI2Cx,I2C_ACK_DISABLE);

				//generate STOP condition
				if(Sr == I2C_DISABLE_SR )
					I2C_GenerateStopCondition(pI2CHandle->pI2Cx);

			}

			//read the data from data register in to buffer
			*pRxBuffer = pI2CHandle->pI2Cx->DR;

			//increment the buffer address
			pRxBuffer++;

		}

	}

	//re-enable ACKing
	if(pI2CHandle->I2C_Config.I2C_AckControl == I2C_ACK_ENABLE)
	{
		I2C_ManageAcking(pI2CHandle->pI2Cx,I2C_ACK_ENABLE);
	}
}

/*******************************************************************************
 * @ingroup api_i2c
 * @brief Manages ACKing of I2C peripheral
 *
 * @param[in]   pI2Cx   Reference to the I2C definition structure
 * @param[in]	EnorDi	Enable or disable macro
 *
 ******************************************************************************/
void I2C_ManageAcking	( I2C_RegDef_t *pI2Cx
						, uint8_t EnorDi
						)
{
	if(EnorDi == I2C_ACK_ENABLE)
	{
		pI2Cx->CR1 |= ( 1 << I2C_CR1_ACK);
	}
	else
	{
		pI2Cx->CR1 &= ~( 1 << I2C_CR1_ACK);
	}
}

/*******************************************************************************
 * @ingroup api_i2c
 * @brief Enables or disables the corresponding IRQ
 *
 * @param[in]   IRQNumber   IRQ number
 * @param[in]	EnorDi		Enable or disable macro
 *
 ******************************************************************************/
void I2C_IRQInterruptConfig ( uint8_t IRQNumber
							, uint8_t EnorDi
							)
{
	if(EnorDi == ENABLE)
	{
		if(IRQNumber <= 31)
		{
			//program ISER0 register
			*NVIC_ISER0 |= ( 1 << IRQNumber );

		}else if(IRQNumber > 31 && IRQNumber < 64 ) //32 to 63
		{
			//program ISER1 register
			*NVIC_ISER1 |= ( 1 << (IRQNumber % 32) );
		}
		else if(IRQNumber >= 64 && IRQNumber < 96 )
		{
			//program ISER2 register //64 to 95
			*NVIC_ISER3 |= ( 1 << (IRQNumber % 64) );
		}
	}else
	{
		if(IRQNumber <= 31)
		{
			//program ICER0 register
			*NVIC_ICER0 |= ( 1 << IRQNumber );
		}else if(IRQNumber > 31 && IRQNumber < 64 )
		{
			//program ICER1 register
			*NVIC_ICER1 |= ( 1 << (IRQNumber % 32) );
		}
		else if(IRQNumber >= 6 && IRQNumber < 96 )
		{
			//program ICER2 register
			*NVIC_ICER3 |= ( 1 << (IRQNumber % 64) );
		}
	}

