mentalibor/STM32f446RE_drivers/Src/stm32f44xx_i2c.c
}

/*******************************************************************************
 * @ingroup api_i2c
 * @brief Configures the IRQ priority
 *
 * @param[in]   IRQNumber   IRQ number
 * @param[in]	IRQPriority	IRQ priority
 *
 ******************************************************************************/
void I2C_IRQPriorityConfig	( uint8_t IRQNumber
							, uint32_t IRQPriority
							)
{
	uint8_t iprx = IRQNumber / 4;
	uint8_t iprx_section  = IRQNumber %4 ;

	uint8_t shift_amount = ( 8 * iprx_section) + ( 8 - NO_PR_BITS_IMPLEMENTED) ;

	*(  NVIC_IPR_BASE_ADDR + iprx ) |=  ( IRQPriority << shift_amount );
}

/*******************************************************************************
 * @ingroup api_i2c
 * @brief Sends data as master in non-blocking mode
 *
 * @param[in]   pI2CHandle  Reference to the I2C handler
 * @param[in]	pTxbuffer	Reference to the TX buffer
 * @param[in]	Len			Length of the TX buffer
 * @param[in]	SlaveAddr	Slave address
 * @param[in]	Sr			Flag for stop condition bit
 *
 * @return uint8_t
 * @retval I2C_BUSY_IN_TX	Currently sending data
 * @retval I2C_BUSY_IN_RX	Currently receiving data
 * @retbal I2C_READY		Currently ready for data transfer
 ******************************************************************************/
uint8_t I2C_MasterSendDataIT	( I2C_Handle_t *pI2CHandle
								, uint8_t *pTxBuffer
								, uint32_t Len
								, uint8_t SlaveAddr
								, uint8_t Sr
								)
{
	uint8_t busystate = pI2CHandle->TxRxState;

	if( (busystate != I2C_BUSY_IN_TX) && (busystate != I2C_BUSY_IN_RX))
	{
		pI2CHandle->pTxBuffer = pTxBuffer;
		pI2CHandle->TxLen = Len;
		pI2CHandle->TxRxState = I2C_BUSY_IN_TX;
		pI2CHandle->DevAddr = SlaveAddr;
		pI2CHandle->Sr = Sr;

		I2C_GenerateStartCondition(pI2CHandle->pI2Cx);

		pI2CHandle->pI2Cx->CR2 |= ( 1 << I2C_CR2_ITBUFEN);

		pI2CHandle->pI2Cx->CR2 |= ( 1 << I2C_CR2_ITEVTEN);

		pI2CHandle->pI2Cx->CR2 |= ( 1 << I2C_CR2_ITERREN);
	}

	return busystate;
}

/*******************************************************************************
 * @ingroup api_i2c
 * @brief Receives data as master in non-blocking mode
 *
 * @param[in]   pI2CHandle  Reference to the I2C handler
 * @param[in]	pTxbuffer	Reference to the RX buffer
 * @param[in]	Len			Length of the RX buffer
 * @param[in]	SlaveAddr	Slave address
 * @param[in]	Sr			Flag for stop condition bit
 *
 * @return uint8_t
 * @retval I2C_BUSY_IN_TX	Currently sending data
 * @retval I2C_BUSY_IN_RX	Currently receiving data
 * @retbal I2C_READY		Currently ready for data transfer
 ******************************************************************************/
uint8_t I2C_MasterReceiveDataIT	( I2C_Handle_t *pI2CHandle
								, uint8_t *pRxBuffer
								, uint8_t Len
								, uint8_t SlaveAddr
								, uint8_t Sr
								)
{
	uint8_t busystate = pI2CHandle->TxRxState;

	if( (busystate != I2C_BUSY_IN_TX) && (busystate != I2C_BUSY_IN_RX))
	{
		pI2CHandle->pRxBuffer = pRxBuffer;
		pI2CHandle->RxLen = Len;
		pI2CHandle->TxRxState = I2C_BUSY_IN_RX;
		pI2CHandle->RxSize = Len;
		pI2CHandle->DevAddr = SlaveAddr;
		pI2CHandle->Sr = Sr;

		I2C_GenerateStartCondition(pI2CHandle->pI2Cx);

		pI2CHandle->pI2Cx->CR2 |= ( 1 << I2C_CR2_ITBUFEN);

		pI2CHandle->pI2Cx->CR2 |= ( 1 << I2C_CR2_ITEVTEN);

		pI2CHandle->pI2Cx->CR2 |= ( 1 << I2C_CR2_ITERREN);
	}

	return busystate;
}

/*******************************************************************************
 * @ingroup api_i2c
 * @brief Closes receiving data process
 *
 * @param[in]   pI2CHandle  Reference to the I2C handler
 *
 ******************************************************************************/
void I2C_CloseReceiveData( I2C_Handle_t *pI2CHandle)
{
	pI2CHandle->pI2Cx->CR2 &= ~( 1 << I2C_CR2_ITBUFEN);

	pI2CHandle->pI2Cx->CR2 &= ~( 1 << I2C_CR2_ITEVTEN);

	pI2CHandle->TxRxState = I2C_READY;
	pI2CHandle->pRxBuffer = NULL;
	pI2CHandle->RxLen = 0;
	pI2CHandle->RxSize = 0;

	if(pI2CHandle->I2C_Config.I2C_AckControl == I2C_ACK_ENABLE)
	{
		I2C_ManageAcking(pI2CHandle->pI2Cx,ENABLE);
	}

}

/*******************************************************************************
 * @ingroup api_i2c
 * @brief Closes sending data process
 *
 * @param[in]   pI2CHandle  Reference to the I2C handler
 *
 ******************************************************************************/
void I2C_CloseSendData( I2C_Handle_t *pI2CHandle)
{
	pI2CHandle->pI2Cx->CR2 &= ~( 1 << I2C_CR2_ITBUFEN);

	pI2CHandle->pI2Cx->CR2 &= ~( 1 << I2C_CR2_ITEVTEN);

	pI2CHandle->TxRxState = I2C_READY;
	pI2CHandle->pTxBuffer = NULL;
	pI2CHandle->TxLen = 0;
}

/*******************************************************************************
 * @ingroup api_i2c
 * @brief Perfoms sending data process in slave mode
 *
 * @param[in]   pI2CHandle  Reference to the I2C handler
 * @param[in]   data  		data
 *
 ******************************************************************************/
void I2C_SlaveSendData	( I2C_RegDef_t *pI2C
						, uint8_t data
						)
{
	pI2C->DR = data;
}

/*******************************************************************************
 * @ingroup api_i2c
 * @brief Perfoms receiving data process in slave mode
 *
 * @param[in]   pI2CHandle  Reference to the I2C handler
 * @param[in]   data  		data
 *
 * @return uint8_t
 * @retval data		0x0 - 0xFF Data
 ******************************************************************************/
uint8_t I2C_SlaveReceiveData( I2C_RegDef_t *pI2C)
{
    return (uint8_t) pI2C->DR;
}

/*******************************************************************************
 * @ingroup api_i2c
 * @brief Handles the interrupt event
 *
 * @param[in]   pI2CHandle  Reference to the I2C handler
 *
 ******************************************************************************/
void I2C_EV_IRQHandling(I2C_Handle_t *pI2CHandle)
{

	uint32_t temp1, temp2, temp3;

	temp1   = pI2CHandle->pI2Cx->CR2 & ( 1 << I2C_CR2_ITEVTEN) ;
	temp2   = pI2CHandle->pI2Cx->CR2 & ( 1 << I2C_CR2_ITBUFEN) ;

	temp3  = pI2CHandle->pI2Cx->SR1 & ( 1 << I2C_SR1_SB);

	if(temp1 && temp3)
	{
		if(pI2CHandle->TxRxState == I2C_BUSY_IN_TX)
		{
			I2C_ExecuteAddressPhaseWrite(pI2CHandle->pI2Cx,pI2CHandle->DevAddr);
		}
		else if (pI2CHandle->TxRxState == I2C_BUSY_IN_RX )
		{
			I2C_ExecuteAddressPhaseRead(pI2CHandle->pI2Cx,pI2CHandle->DevAddr);
		}
	}

