mentalibor/STM32f446RE_drivers/Src/stm32f44xx_i2c.c
	temp3  = pI2CHandle->pI2Cx->SR1 & ( 1 << I2C_SR1_ADDR);

	if(temp1 && temp3)
	{
		I2C_ClearADDRFlag(pI2CHandle);
	}

	temp3  = pI2CHandle->pI2Cx->SR1 & ( 1 << I2C_SR1_BTF);

	if(temp1 && temp3)
	{
		if(pI2CHandle->TxRxState == I2C_BUSY_IN_TX)
		{
			if(pI2CHandle->pI2Cx->SR1 & ( 1 << I2C_SR1_TXE) )
			{
				if(pI2CHandle->TxLen == 0 )
				{
					if(pI2CHandle->Sr == I2C_DISABLE_SR)
						I2C_GenerateStopCondition(pI2CHandle->pI2Cx);

					I2C_CloseSendData(pI2CHandle);

					I2C_ApplicationEventCallback(pI2CHandle,I2C_EV_TX_CMPLT);
				}
			}

		}
		else if (pI2CHandle->TxRxState == I2C_BUSY_IN_RX )
		{
			;
		}
	}

	temp3  = pI2CHandle->pI2Cx->SR1 & ( 1 << I2C_SR1_STOPF);

	if(temp1 && temp3)
	{
		pI2CHandle->pI2Cx->CR1 |= 0x0000;

		I2C_ApplicationEventCallback(pI2CHandle,I2C_EV_STOP);
	}

	temp3  = pI2CHandle->pI2Cx->SR1 & ( 1 << I2C_SR1_TXE);

	if(temp1 && temp2 && temp3)
	{
		if(pI2CHandle->pI2Cx->SR2 & ( 1 << I2C_SR2_MSL))
		{
			if(pI2CHandle->TxRxState == I2C_BUSY_IN_TX)
			{
				I2C_MasterHandleTXEInterrupt(pI2CHandle);
			}
		}
		else
		{
		    if(pI2CHandle->pI2Cx->SR2 & ( 1 << I2C_SR2_TRA))
		    {
		    	I2C_ApplicationEventCallback(pI2CHandle,I2C_EV_DATA_REQ);
		    }
		}
	}

	temp3  = pI2CHandle->pI2Cx->SR1 & ( 1 << I2C_SR1_RXNE);

	if(temp1 && temp2 && temp3)
	{
		if(pI2CHandle->pI2Cx->SR2 & ( 1 << I2C_SR2_MSL))
		{
			if(pI2CHandle->TxRxState == I2C_BUSY_IN_RX)
			{
				I2C_MasterHandleRXNEInterrupt(pI2CHandle);

			}

		}else
		{
			if(!(pI2CHandle->pI2Cx->SR2 & ( 1 << I2C_SR2_TRA)))
			{
				I2C_ApplicationEventCallback(pI2CHandle,I2C_EV_DATA_RCV);
			}
		}
	}
}

/*******************************************************************************
 * @ingroup api_i2c
 * @brief Handles the interrupt error
 *
 * @param[in]   pI2CHandle  Reference to the I2C handler
 *
 ******************************************************************************/
void I2C_ER_IRQHandling( I2C_Handle_t *pI2CHandle)
{

	uint32_t temp1,temp2;

	temp2 = (pI2CHandle->pI2Cx->CR2) & ( 1 << I2C_CR2_ITERREN);

	temp1 = (pI2CHandle->pI2Cx->SR1) & ( 1<< I2C_SR1_BERR);

	if(temp1  && temp2 )
	{
		pI2CHandle->pI2Cx->SR1 &= ~( 1 << I2C_SR1_BERR);

		I2C_ApplicationEventCallback(pI2CHandle,I2C_ERROR_BERR);
	}

	temp1 = (pI2CHandle->pI2Cx->SR1) & ( 1 << I2C_SR1_ARLO );

	if(temp1  && temp2)
	{
		pI2CHandle->pI2Cx->SR1 &= ~( 1 << I2C_SR1_ARLO);

		I2C_ApplicationEventCallback(pI2CHandle,I2C_ERROR_ARLO);
	}


	temp1 = (pI2CHandle->pI2Cx->SR1) & ( 1 << I2C_SR1_AF);

	if(temp1  && temp2)
	{
		pI2CHandle->pI2Cx->SR1 &= ~( 1 << I2C_SR1_AF);

		I2C_ApplicationEventCallback(pI2CHandle,I2C_ERROR_AF);
	}

	temp1 = (pI2CHandle->pI2Cx->SR1) & ( 1 << I2C_SR1_OVR);

	if(temp1  && temp2)
	{
		pI2CHandle->pI2Cx->SR1 &= ~( 1 << I2C_SR1_OVR);

		I2C_ApplicationEventCallback(pI2CHandle,I2C_ERROR_OVR);
	}

	temp1 = (pI2CHandle->pI2Cx->SR1) & ( 1 << I2C_SR1_TIMEOUT);

	if(temp1  && temp2)
	{
		pI2CHandle->pI2Cx->SR1 &= ~( 1 << I2C_SR1_TIMEOUT);

		I2C_ApplicationEventCallback(pI2CHandle,I2C_ERROR_TIMEOUT);
	}
}

/*******************************************************************************
 * @ingroup api_i2c
 * @brief Application event callback function
 *
 * @param[in]   pI2CHandle  Reference to the I2C handler
 * @param[in]   AppEv  		Application event macro
 *
 ******************************************************************************/
__attribute__((weak)) void I2C_ApplicationEventCallback	( I2C_Handle_t *pI2CHandle
									, uint8_t AppEv
									)
{
	/* This is a week implementation. The application may override this function. */
}

static void I2C_GenerateStartCondition( I2C_RegDef_t *pI2Cx)
{
	pI2Cx->CR1 |= ( 1 << I2C_CR1_START);
}

static void I2C_ExecuteAddressPhaseWrite	( I2C_RegDef_t *pI2Cx
											, uint8_t SlaveAddr
											)
{
	SlaveAddr = SlaveAddr << 1;
	SlaveAddr &= ~(1);
	pI2Cx->DR = SlaveAddr;
}

static void I2C_ExecuteAddressPhaseRead (I2C_RegDef_t *pI2Cx
										, uint8_t SlaveAddr
										)
{
	SlaveAddr = SlaveAddr << 1;
	SlaveAddr |= 1;
	pI2Cx->DR = SlaveAddr;
}

static void I2C_ClearADDRFlag( I2C_Handle_t *pI2CHandle )
{
	uint32_t dummy_read;

	//check for device mode
	if(pI2CHandle->pI2Cx->SR2 & ( 1 << I2C_SR2_MSL))
	{
		//device is in master mode
		if(pI2CHandle->TxRxState == I2C_BUSY_IN_RX)
		{
			if(pI2CHandle->RxSize  == 1)
			{
				//disable the ack
				I2C_ManageAcking(pI2CHandle->pI2Cx,DISABLE);

				dummy_read = pI2CHandle->pI2Cx->SR1;
				dummy_read = pI2CHandle->pI2Cx->SR2;
				(void)dummy_read;
			}

		}
		else
		{
			dummy_read = pI2CHandle->pI2Cx->SR1;
			dummy_read = pI2CHandle->pI2Cx->SR2;
			(void)dummy_read;
		}
	}
	else
	{
		//device is in slave mode
		dummy_read = pI2CHandle->pI2Cx->SR1;
		dummy_read = pI2CHandle->pI2Cx->SR2;
		(void)dummy_read;
	}
}

static void I2C_MasterHandleRXNEInterrupt( I2C_Handle_t *pI2CHandle )
{
	if(pI2CHandle->RxSize == 1)
	{
		*pI2CHandle->pRxBuffer = pI2CHandle->pI2Cx->DR;
		pI2CHandle->RxLen--;

	}

	if(pI2CHandle->RxSize > 1)
	{
		if(pI2CHandle->RxLen == 2)
		{
			//clear the ack bit
			I2C_ManageAcking(pI2CHandle->pI2Cx,DISABLE);
		}

			//read DR
			*pI2CHandle->pRxBuffer = pI2CHandle->pI2Cx->DR;
			pI2CHandle->pRxBuffer++;
			pI2CHandle->RxLen--;
	}

	if(pI2CHandle->RxLen == 0 )
	{
		//then close the I2C data reception and notify the application

		//generate the stop condition
		if(pI2CHandle->Sr == I2C_DISABLE_SR)
			I2C_GenerateStopCondition(pI2CHandle->pI2Cx);

		//Close the I2C rx
		I2C_CloseReceiveData(pI2CHandle);

		//Notify the application
		I2C_ApplicationEventCallback(pI2CHandle,I2C_EV_RX_CMPLT);
	}
}

static void I2C_MasterHandleTXEInterrupt( I2C_Handle_t *pI2CHandle )
{
	if(pI2CHandle->TxLen > 0)
	{
		//load the data in to DR
		pI2CHandle->pI2Cx->DR = *(pI2CHandle->pTxBuffer);

		//decrement the TxLen
		pI2CHandle->TxLen--;

		//Increment the buffer address
		pI2CHandle->pTxBuffer++;
	}
}

